[
    {
        "project_name": "Knowledge Graph-based Recommendation System",
        "project_description": [
            "Developed a knowledge graph-based recommendation system for Semantically, a biomedical platform enhancing health data retrieval through enriched metadata.",
            "Created a Neo4j graph database to store medical ontology and expert data, enabling accurate and efficient recommendations.",
            "Rewrote PHP backend to support Cypher queries for Neo4j data retrieval and integrated D3.js for interactive ontology graph visualization."
        ],
        "tech_stack": [
            "html5",
            "css3",
            "javascript",
            "bootstrap",
            "react",
            "php",
            "neo4j"
        ],
        "project_thumbnail": "project_thumbnails/knowledge_graph_thumbnail.webp",
        "project_link": "https://github.com/bukharilab/KG4BioMedCntnAuthoring"
    },
    {
        "project_name": "AI Tutor",
        "project_description": [
            "Collaborated with a team to create an AI-powered Intelligent Tutoring System that personalizes learning through adaptive scaffolding.",
            "Implemented the system's UI using Bootstrap to quickly prepare a modern, responsive frontend.",
            "Dockerized frontend and backend repositories to ensure all teammates have the same dependency versions.",
            "Set up AWS S3, Cloudfront, EC2, RDS and Secrets manager to host a demo for the MSCHE conference event, making our app accessible for testing and collecting user feedback (Website currently under maintenance).",
            "Code not available on Github due to security concerns but general information about the research lab is here: https://github.com/sju-nlp-lab."
        ],
        "tech_stack": [
            "html5",
            "css3",
            "javascript",
            "bootstrap",
            "react",
            "vitejs",
            "docker",
            "python",
            "mysql",
            "amazonwebservices"
        ],
        "project_thumbnail": "project_thumbnails/ai_tutor_thumbnail.webp",
        "project_link": "https://ai-tutor-app.com"
    },
    
    {
        "project_name": "Billiards Sol y Luna Order Tracking Desktop App",
        "project_description": [
            "Developed an offline order tracking desktop app for the family business to manage current orders, past invoices and status of debts owed.",
            "Used React-Bootstrap to implement bootstrap components that work seamlessly with React's component-based system.",
            "Added tip options, sales tax and receipt history section with debt status for unpaid orders, boosting the business' profits with a seamless invoice generation system."
        ],
        "tech_stack": [
            "html5",
            "css3",
            "javascript",
            "bootstrap",
            "react",
            "vitejs",
            "electron"
        ],
        "project_thumbnail": "project_thumbnails/billiards_order_tracker_thumbnail.webp",
        "project_link": "https://github.com/SebC750/BilliardsSolYLuna"
    },
    {
        "project_name": "Billiards Sol y Luna Website",
        "project_description": [
            "Hosted a public website for the family business, a pool hall and bar in Corona, NY, to display public information including menu items and special offers.",
            "Added the website to the google business page so visitors can easily find information on the establishment.",
            "Leveraged typescript's typing system to create strongly typed data structures for objects such as gallery images and information cards."
        ],
        "tech_stack": [
            "html5",
            "css3",
            "typescript",
            "tailwindcss",
            "react",
            "vitejs",
            "googlecloud"
        ],
        "project_thumbnail": "project_thumbnails/billiards_website_thumbnail.webp",
        "project_link": "https://billiardssolylunawebsite.web.app/"
    }
    
]