[
    {
        "project_name": "Semantically Knowledge Graph-based Recommendation System",
        "project_description": "I contributed to an existing research project in which I was tasked with developing a knowledge graph-based recommendation system. I leveraged Neo4j's entity-relationship data structure to store medical ontologies in a machine readable format, allowing for accurate retrival of ontology definitions for medical experts.",
        "tech_stack": ["html5", "css3","javascript", "bootstrap","php","mysql"],
        "project_thumbnail":"project_thumbnails/knowledge_graph_thumbnail.webp",
        "project_link": "https://github.com/bukharilab/KG4BioMedCntnAuthoring"
    },
    {
        "project_name": "AI Tutor",
        "project_description": "I work with a team to develop an AI-powered intelligent tutoring system designed to personalize students' learning environments through scaffolding. Our system is meant to address long-standing problems with standardized curriculums by tailoring learning structure for various learning styles. Currently also exploring cloud hosting for the demo.",
        "tech_stack": ["html5", "css3","javascript", "bootstrap","python","mysql"],
        "project_thumbnail":"project_thumbnails/ai_tutor_thumbnail.webp",
        "project_link": "https://github.com/sju-nlp-lab"
    },
    {
        "project_name": "My Personal Art Gallery",
        "project_description": "I created a website where I host my collection of artworks and illustrations I have made over the years since high school. My website includes different kinds of art from comics, single illustrations and animations. I am also currently working on a backend to store my artworks and allow commenting on posts.",
        "tech_stack": ["html5", "css3","javascript", "bootstrap","python","mongodb"],
        "project_thumbnail":"project_thumbnails/art_gallery_thumbnail.webp",
        "project_link": "https://art-gallery-portfolio.vercel.app/"
    },
    {
        "project_name": "Vehicular Cloud Real Time System",
        "project_description": "I collaborated with a team to work on a capstone project where we built a client-server architecture that simulates the use of computer hardware of vehicles to execute jobs such as image processing, file storage etc. The system is complete with a frontend GUI and a backend server.",
        "tech_stack": ["java", "mysql"],
        "project_thumbnail":"project_thumbnails/vcrts_thumbnail.webp",
        "project_link": "https://github.com/nixkhm/VCRTSGroup4"
    },
    {
        "project_name": "Biophysics Group Research Lab Website",
        "project_description": "Built a static website to display public information about a biophysics research group based in Colombia. The website provides information about the team's areas of research, members, publications and contact information.",
        "tech_stack": ["html5", "css3","javascript", "bootstrap"],
        "project_thumbnail":"project_thumbnails/biophysics_group_thumbnail.webp",
        "project_link": "https://marco-lab-website.vercel.app/"
    },
    {
        "project_name": "Wine Quality Dataset",
        "project_description": "Participated in a kaggle competition where I competed against 15 other developers to use the regression model that can most accurately predict the quality of wine given sample training data. I conducted numerous training I finished in fourth place.",
        "tech_stack": ["python"],
        "project_thumbnail":"project_thumbnails/wine_quality_thumbnail.webp",
        "project_link": "https://www.kaggle.com/competitions/wine-quality-final-dataset/leaderboard"
    },
    {
        "project_name": "Billiards Sol y Luna Order Tracking Desktop App",
        "project_description": "For many years, my family's business has been catering to customers in a pool hall. Current methods of tracking orders are tedious and unreliable. To solve this issue, I created an order tracking system for our business. The program maintains an order history, tracked orders, pool table timers and debt status to resolve disputes.",
        "tech_stack": ["html5", "css3","javascript", "bootstrap","electron"],
        "project_thumbnail":"project_thumbnails/billiards_order_tracker_thumbnail.webp",
        "project_link": "https://github.com/SebC750/BilliardsSolYLuna"
    },
    {
        "project_name": "Billiards Sol y Luna Website",
        "project_description": "Recently, I have observed that people coming into the business recently mention that they found the business on google. I decided to work on a website to display public information about the establishment, what we offer and contact information. This website is a work in progress.",
        "tech_stack": ["html5", "css3","typescript", "tailwindcss"],
        "project_thumbnail":"project_thumbnails/billiards_website_thumbnail.webp",
        "project_link": "https://github.com/SebC750/BilliardsSolYLuna"
    }
    
]